OpenFOAM case folders/Experimental validation/Static drift/FoilShipSharp/T0.22_Fr0.2_alpha7.5/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     controlDict;
}

libs                 ("libOpenFOAM.so" "libfvOptions.so" );
application          interFoam;
startFrom            latestTime;
startTime            0;
stopAt               endTime;
endTime              23.44;
deltaT               0.03349;
writeControl         adjustableRunTime;
writeInterval        0.2344;
purgeWrite           2;
writeFormat          ascii;
writePrecision       9;
writeCompression     off;
timeFormat           general;
timePrecision        9;
runTimeModifiable    yes;
adjustTimeStep       yes;
maxCo                40.0;
maxDeltaT            0.03349;
maxAlphaCo           10.0;

functions
{
	#include "forces";
}
